In [2]:
# Importing the libraries
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [4]:
dataset = pd.read_csv('data.csv')

In [5]:
dataset

  experience  test_score  interview_score  salary
0        NaN         8.0                9  500000
1        NaN         8.0                6  450000
2       five         6.0                7  600000
3        two        10.0               10  650000
4      seven         9.0                6  700000
5      three         7.0               10  620000
6        ten         NaN                7  720000
7     eleven         7.0                8  800000

In [6]:
dataset['test_score'].fillna(0, inplace=True)

In [8]:
dataset['experience'].fillna(0, inplace=True)

In [20]:
dataset

  experience  test_score  interview_score  salary
0          0         8.0                9  500000
1          0         8.0                6  450000
2       five         6.0                7  600000
3        two        10.0               10  650000
4      seven         9.0                6  700000
5      three         7.0               10  620000
6        ten         0.0                7  720000
7     eleven         7.0                8  800000

In [11]:

x = dataset.iloc[:, :3]
x

  experience  test_score  interview_score
0          0         8.0                9
1          0         8.0                6
2       five         6.0                7
3        two        10.0               10
4      seven         9.0                6
5      three         7.0               10
6        ten         0.0                7
7     eleven         7.0                8

In [13]:
#convert the words into integer
def convert_to_int(word):
    word_dict = {'one':1, 'two':2, 'three':3, 'four':4, 'five':5, 'six':6, 'seven':7, 'eight':8,
                'nine':9, 'ten':10, 'eleven':11, 'twelve':12, 'zero':0, 0: 0}
    return word_dict[word]

In [14]:
x['experience'] = x['experience'].apply(lambda x : convert_to_int(x))

In [15]:
y = dataset.iloc[:, -1]
y

0    500000
1    450000
2    600000
3    650000
4    700000
5    620000
6    720000
7    800000
Name: salary, dtype: int64

In [16]:
from sklearn.linear_model import LinearRegression
regressor = LinearRegression()
#Fitting model with trainig data
regressor.fit(x, y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None,
         normalize=False)

In [18]:
model = regressor
model

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None,
         normalize=False)

In [19]:
print(int(model.predict([[4,6,8]])))

600816

In [24]:
print("The salary is predicted as Rs:",int(model.predict([[5, 6, 7]])))

The salary is predicted as Rs: 610409